icub-tech-iit/ventilator-FI5/tests/boards/stm32f7disco/stm32hal/src/board/f7disco/v1280/src/board_f7disco_v1280.c

/*
 * Copyright (C) 2020 iCub Tech - Istituto Italiano di Tecnologia
 * Author:  Marco Accame
 * email:   marco.accame@iit.it
 * NOTE:    this code is a custumization for the ventilator project 
 *          of code originally published in https://github.com/robotology/icub-firmware
 *
*/


// --------------------------------------------------------------------------------------------------------------------
// - external dependencies
// --------------------------------------------------------------------------------------------------------------------

#include "stm32hal.h"


#include "string.h"

#include "main.h"

// --------------------------------------------------------------------------------------------------------------------
// - declaration of extern public interface
// --------------------------------------------------------------------------------------------------------------------

#include "stm32hal_board.h"

// --------------------------------------------------------------------------------------------------------------------
// - #define with internal scope
// --------------------------------------------------------------------------------------------------------------------

// used to remove code generated by cubemx which we dont want. such as the init of the systick
#define STM32HAL_BSP_REMOVE_CUBEMX_CODE


// --------------------------------------------------------------------------------------------------------------------
// - definition (and initialisation) of extern variables, but better using _get(), _set() 
// --------------------------------------------------------------------------------------------------------------------
// empty-section



// --------------------------------------------------------------------------------------------------------------------
// - typedef with internal scope
// --------------------------------------------------------------------------------------------------------------------
// empty-section



// --------------------------------------------------------------------------------------------------------------------
// - declaration of static functions
// --------------------------------------------------------------------------------------------------------------------

// functions generated by cubemx and typically placed into main.c. 
// i put them in static section AND I ADD THE KEYWORD "static" because their scope is local
static void SystemClock_Config(void);

static void CPU_CACHE_Enable(void);

//void HHEwBspConsoleInit( void );

#if defined(EDL_DRIVER_CODE)

// the used timers for the pwm are: 1, 8, 12
// 
// the gpios are: 
// PA0, PF10, PF9, PF8, PF7, PB8, PB9, PI1, PB14, PB15, PA8, PA15, PI2, PH6, PI0, PG7, PB4, PG6, PC7 

static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_ADC3_Init(void);
static void MX_CRC_Init(void);
static void MX_DMA2D_Init(void);
static void MX_I2C1_Init(void);
static void MX_I2C3_Init(void);
static void MX_LTDC_Init(void);
static void MX_QUADSPI_Init(void);
static void MX_RTC_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM5_Init(void);
static void MX_TIM8_Init(void);
static void MX_TIM12_Init(void);
static void MX_USART1_UART_Init(void);

#endif

// --------------------------------------------------------------------------------------------------------------------
// - definition (and initialisation) of static variables
// --------------------------------------------------------------------------------------------------------------------
// empty-section


// --------------------------------------------------------------------------------------------------------------------
// - definition of extern public functions
// --------------------------------------------------------------------------------------------------------------------


extern void stm32hal_board_init(void)
{
    // in here we get the code generated by cube-mx and present in main.c and we keep just what we need
    // OR... any code in main.c of the template project from stm
    
    // IIT-ICUB-TECH-CUSTOMIZATION
    // this code was origininally inside the main.c of a template project
    
  /* This project template calls firstly CPU_CACHE_Enable() in order to enable the CPU Cache.
     This function is provided as template implementation that User may integrate 
     in his application, to enhance the performance in case of use of AXI interface 
     with several masters. */

  /* Enable the CPU Cache */
  CPU_CACHE_Enable();

  /* STM32F7xx HAL library initialization:
       - Configure the Flash ART accelerator on ITCM interface
       - Configure the Systick to generate an interrupt each 1 msec
       - Set NVIC Group Priority to 4
       - Low Level Initialization
     */
  HAL_Init();

  /* Configure the System clock to have a frequency of 216 MHz */
  SystemClock_Config();    

    /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
//    HAL_Init();
   

//    /* Configure the system clock */
//    SystemClock_Config();

//    
//    /* Initialize all configured peripherals */
////    MX_GPIO_Init();
////    MX_DMA_Init();
//////  MX_ETH_Init();
////    MX_USART3_UART_Init();
//////    MX_USB_OTG_FS_PCD_Init();
//////  MX_FDCAN1_Init();
////// this funtion is called inside embot::hw::i2c::init()  MX_I2C1_Init();

#if defined(EDL_DRIVER_CODE)

    MX_GPIO_Init();
    MX_DMA_Init();
    MX_ADC3_Init();
//    MX_CRC_Init();
//    MX_DMA2D_Init();
    MX_I2C1_Init();
//    MX_I2C3_Init();
//    MX_LTDC_Init();
//    MX_QUADSPI_Init();
//    MX_RTC_Init();
    MX_TIM1_Init();
//    MX_TIM2_Init();
//    MX_TIM3_Init();
//    MX_TIM5_Init();
    MX_TIM8_Init();
    MX_TIM12_Init();
//    MX_USART1_UART_Init(); // at the moment is managed w/ code taken from ew.
  
#endif


//    HHEwBspConsoleInit();

 }


// --------------------------------------------------------------------------------------------------------------------
// - definition of funtions genrated by cube-mx which must be global..... sic!
// --------------------------------------------------------------------------------------------------------------------

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */

  /* USER CODE END Error_Handler_Debug */
}


